package ch12_inheritance;
/*
    Tiger.java처럼 Animal 클래스를 상속 받고
    생성자 및 getter / setter 다 정의하시고
    Animal 클래스의 move() 메서드를 오버라이딩하여
    "사람이 두 발로 걷습니다."만 출력하도록 '재정의'하시고

    Main.java에서
    human1 객체를 생성(기본생성자사용)하여 setter를 활용,
    여러분이름과 여러분나이를 입력,
    getter를 활용하여
    "안녕하세요, 제 이름은 여러분이름이고 나이는 몇살입니다."
    "내년에는 몇+1살이 됩니다."를 출력하시오.

    또한 Human 클래스의 고유 메서드인 read("자바의 기초")를
    정의하여 콘솔에 다음과 같이 출력될 수 있도록 하시오.

    "여러분이름은 자바의 기초를 읽는 중입니다."

    -> read 메서드는 이상의 호출 방식을 봤을 때 call2()유형입니다.

    실행 예
    사람 객체가 생성되었습니다.
    사람이 두 발로 걷습니다.
    안녕하세요, 제 이름은 여러분이름이고 나이는 몇살입니다.
    내년에는 몇+1살이 됩니다.
    여러분이름은 자바의 기초를 읽는 중입니다.
 */
public class Human {
    public static void main(String[] args) {
        
    }
}